## Read Files with Pandas

### CSV File
- Comma-Separated Values 逗號分割值
- 像是Excel的表格文件檔案，內容為純文字
- 表格分隔方式
  - 空格 " "
  - 逗號 ","
  - TAB "\t"
- 副檔名通常為".csv"，只是方便作業系統辨識，並推薦可使用何種軟體開啟

> Note: 「\」處理跳脫字元，"\n"代表換行符號，可以當作是按下一個 "ENTER" 鍵

Reference: [CSV WIKI](https://zh.wikipedia.org/zh-tw/%E9%80%97%E5%8F%B7%E5%88%86%E9%9A%94%E5%80%BC)

In [27]:
import pandas as pd

# Read csv file and save it to a DataFrame
df = pd.read_csv('output1.csv')
display(df)

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000

In [ ]:
# Read excel file and save it to a DataFrame
df_excel = pd.read_excel('output2.xlsx')
display(df_excel)

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000

In [ ]:
# Add new rows / Concat two DataFrames
new_data = {
    'Name': ['Denny', 'Elly', 'Frank'],
    'Age': [54, 18, 70],
    'City': ['Chicago', 'Los Angeles', 'Los Angeles'],
    'Salary': [110000, 36000, 30000]
}
new_rows = pd.DataFrame(new_data)
display(new_rows)

print("-----")

new_df = pd.concat([df, new_rows], ignore_index=True)
display(new_df)

# index=False means that the index will not be written to the file
# new_df.to_csv('output3.csv', index=False)
# new_df.to_csv('output3.csv')

    Name  Age         City  Salary
0  Denny   54      Chicago  110000
1   Elly   18  Los Angeles   36000
2  Frank   70  Los Angeles   30000

-----

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000
3    Denny   54      Chicago  110000
4     Elly   18  Los Angeles   36000
5    Frank   70  Los Angeles   30000